payment and notification
